#include<iostream>
using namespace std;
#define MAX 1000001
#define MOD 15746
// 전형적인~! dp문제였슴다~! 아주 쉬웠어용~!!^^
// 규칙만 파악하면 되는 문제였슴다^^
/*
    N = 1 => 1 => 1
    N = 2 => 11, 00 => 2
    N = 3 => 111, 100, 001 => 3
    N = 4 => 1111, 1100, 1001, 0011, 0000 => 5
    N = 5 => 11100, 11001, 10011, 00111, 10000, 00100, 00001, 11111 => 8
    N = 6 => 111100, 111001, 110011, 100111, 001111, 110000, 000011, 100001, 001001, 100100, 001100, 000000,  111111 => 13개
    dp[i] = dp[i-1] + dp[i-2]
*/
int main() {
    int N;
    int dp[MAX];
    
    cin >> N;
    
    dp[1] = 1;
    dp[2] = 2;
    
    for(int i=3; i<=N; i++) {
        dp[i] = (dp[i-1] + dp[i-2]) % MOD;
    }
    
    cout << dp[N];
    return 0;
}